bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA324PB.xml
            <module name="TC8">
                <instance name="TC0" caption="Timer/Counter, 8-bit">
                    <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"
                                    caption="Timer/Counter, 8-bit"/>
                    <signals>
                        <signal group="T" function="default" pad="PB0"/>
                        <signal group="OCB" function="default" pad="PB4"/>
                        <signal group="OCA" function="default" pad="PB3"/>
                    </signals>
                </instance>
            </module>
            <module name="TC16">
                <instance name="TC1" caption="Timer/Counter, 16-bit">
                    <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data"
                                    caption="Timer/Counter, 16-bit"/>
                    <signals>
                        <signal group="T" function="default" pad="PB1"/>
                        <signal group="ICP" function="default" pad="PD6"/>
                        <signal group="OCA" function="default" pad="PD5"/>
                        <signal group="OCB" function="default" pad="PD4"/>
                    </signals>
                </instance>
                <instance name="TC3" caption="Timer/Counter, 16-bit">
                    <register-group name="TC3" name-in-module="TC3" offset="0x00" address-space="data"
                                    caption="Timer/Counter, 16-bit"/>
                    <signals>
                        <signal group="T" function="default" pad="PD0"/>
                        <signal group="ICP" function="default" pad="PB5"/>
                        <signal group="OCA" function="default" pad="PB6"/>
                        <signal group="OCB" function="default" pad="PB7"/>
                    </signals>
                </instance>
                <instance name="TC4" caption="Timer/Counter, 16-bit">
                    <register-group name="TC4" name-in-module="TC4" offset="0x00" address-space="data"
                                    caption="Timer/Counter, 16-bit"/>
                    <signals>
                        <signal group="T" function="default" pad="PC2"/>
                        <signal group="ICP" function="default" pad="PC3"/>
                        <signal group="OCA" function="default" pad="PC4"/>
                        <signal group="OCB" function="default" pad="PB7"/>
                    </signals>
                </instance>
            </module>
            <module name="TC8_ASYNC">
                <instance name="TC2" caption="Timer/Counter, 8-bit Async">
                    <register-group name="TC2" name-in-module="TC2" offset="0x00" address-space="data"
                                    caption="Timer/Counter, 8-bit Async"/>
                    <signals>
                        <signal group="OCA" function="default" pad="PD7"/>
                        <signal group="OCB" function="default" pad="PD6"/>
                    </signals>
                </instance>
            </module>
            <module name="WDT">
                <instance name="WDT" caption="Watchdog Timer">
                    <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data"
                                    caption="Watchdog Timer"/>
                </instance>
            </module>
            <module name="PTC">
                <instance name="PTC" caption="Peripheral Touch Controller">
                    <signals>
                        <signal group="X" index="0" function="default" pad="PD0"/>
                        <signal group="X" index="1" function="default" pad="PD1"/>
                        <signal group="X" index="2" function="default" pad="PD2"/>
                        <signal group="X" index="3" function="default" pad="PD3"/>
                        <signal group="X" index="4" function="default" pad="PD4"/>
                        <signal group="X" index="5" function="default" pad="PD5"/>
                        <signal group="X" index="6" function="default" pad="PD6"/>
                        <signal group="X" index="7" function="default" pad="PD7"/>
                        <signal group="X" index="8" function="default" pad="PE2"/>
                        <signal group="X" index="9" function="default" pad="PE3"/>
                        <signal group="X" index="10" function="default" pad="PC0"/>
                        <signal group="X" index="11" function="default" pad="PC1"/>
                        <signal group="X" index="12" function="default" pad="PC2"/>
                        <signal group="X" index="13" function="default" pad="PC3"/>
                        <signal group="X" index="14" function="default" pad="PC4"/>
                        <signal group="X" index="15" function="default" pad="PC5"/>
                        <signal group="Y" index="0" function="default" pad="PA0"/>
                        <signal group="Y" index="1" function="default" pad="PA1"/>
                        <signal group="Y" index="2" function="default" pad="PA2"/>
                        <signal group="Y" index="3" function="default" pad="PA3"/>
                        <signal group="Y" index="4" function="default" pad="PA4"/>
                        <signal group="Y" index="5" function="default" pad="PA5"/>
                        <signal group="Y" index="6" function="default" pad="PA6"/>
                        <signal group="Y" index="7" function="default" pad="PA7"/>
                        <signal group="Y" index="8" function="default" pad="PD0"/>
                        <signal group="Y" index="9" function="default" pad="PD1"/>
                        <signal group="Y" index="10" function="default" pad="PD2"/>
                        <signal group="Y" index="11" function="default" pad="PD3"/>
                        <signal group="Y" index="12" function="default" pad="PD4"/>
                        <signal group="Y" index="13" function="default" pad="PD5"/>
                        <signal group="Y" index="14" function="default" pad="PD6"/>
                        <signal group="Y" index="15" function="default" pad="PD7"/>
                        <signal group="Y" index="16" function="default" pad="PE2"/>
                        <signal group="Y" index="17" function="default" pad="PE3"/>
                        <signal group="Y" index="18" function="default" pad="PC0"/>
                        <signal group="Y" index="19" function="default" pad="PC1"/>
                        <signal group="Y" index="20" function="default" pad="PC2"/>
                        <signal group="Y" index="21" function="default" pad="PC3"/>
                        <signal group="Y" index="22" function="default" pad="PC4"/>
                        <signal group="Y" index="23" function="default" pad="PC5"/>
                        <signal group="Y" index="24" function="default" pad="PB0"/>
                        <signal group="Y" index="25" function="default" pad="PB1"/>
                        <signal group="Y" index="26" function="default" pad="PB2"/>
                        <signal group="Y" index="27" function="default" pad="PB3"/>
                        <signal group="Y" index="28" function="default" pad="PB4"/>
                        <signal group="Y" index="29" function="default" pad="PB5"/>
                        <signal group="Y" index="30" function="default" pad="PB6"/>
                        <signal group="Y" index="31" function="default" pad="PB7"/>
                    </signals>
                </instance>
            </module>
