bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA324PB.xml
            <value-group caption="" name="ENUM_BOOTSZ">
                <value caption="Boot Flash size=256 words start address=$3F00" name="256W_3F00" value="0x03"/>
                <value caption="Boot Flash size=512 words start address=$3E00" name="512W_3E00" value="0x02"/>
                <value caption="Boot Flash size=1024 words start address=$3C00" name="1024W_3C00" value="0x01"/>
                <value caption="Boot Flash size=2048 words start address=$3800" name="2048W_3800" value="0x00"/>
            </value-group>
            <value-group caption="" name="ENUM_BODLEVEL">
                <value caption="Brown-out detection disabled" name="DISABLED" value="0x07"/>
                <value caption="Brown-out detection at VCC=1.8 V" name="1V8" value="0x06"/>
                <value caption="Brown-out detection at VCC=2.7 V" name="2V7" value="0x05"/>
                <value caption="Brown-out detection at VCC=4.3 V" name="4V3" value="0x04"/>
            </value-group>
        </module>
        <module caption="Lockbits" name="LOCKBIT">
            <register-group caption="Lockbits" name="LOCKBIT">
                <register caption="" name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
                    <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
                    <bitfield caption="Boot Loader Protection Mode" mask="0x0C" name="BLB0" values="ENUM_BLB"/>
                    <bitfield caption="Boot Loader Protection Mode" mask="0x30" name="BLB1" values="ENUM_BLB2"/>
                </register>
            </register-group>
            <value-group caption="" name="ENUM_LB">
                <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
                <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
                <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_BLB">
                <value caption="LPM and SPM prohibited in Application Section" name="LPM_SPM_DISABLE" value="0x00"/>
                <value caption="LPM prohibited in Application Section" name="LPM_DISABLE" value="0x01"/>
                <value caption="SPM prohibited in Application Section" name="SPM_DISABLE" value="0x02"/>
                <value caption="No lock on SPM and LPM in Application Section" name="NO_LOCK" value="0x03"/>
            </value-group>
            <value-group caption="" name="ENUM_BLB2">
                <value caption="LPM and SPM prohibited in Boot Section" name="LPM_SPM_DISABLE" value="0x00"/>
                <value caption="LPM prohibited in Boot Section" name="LPM_DISABLE" value="0x01"/>
                <value caption="SPM prohibited in Boot Section" name="SPM_DISABLE" value="0x02"/>
                <value caption="No lock on SPM and LPM in Boot Section" name="NO_LOCK" value="0x03"/>
            </value-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1"
                          ocd-rw="R">
                    <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
                    <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
                    <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
                    <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
                    <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
                    <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
                    <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS"
                              values="ANALOG_COMP_INTERRUPT"/>
                </register>
                <register caption="Analog Comparator Control And Status Register B" name="ACSRB" offset="0x4F" size="1"
                          ocd-rw="R">
                    <bitfield caption="Analog Comparator Output enable" mask="0x01" name="ACOE"/>
                </register>
                <register caption="Digital Input Disable Register 1" name="DIDR1" offset="0x7F" size="1">
                    <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
                    <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="USART" name="USART">
            <register-group caption="USART" name="USART0">
                <register caption="USART I/O Data Register" name="UDR0" offset="0xC6" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART Control and Status Register A" name="UCSR0A" offset="0xC0" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC"/>
                    <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE"/>
                    <bitfield caption="Data overRun" mask="0x08" name="DOR"/>
                    <bitfield caption="Parity Error" mask="0x04" name="UPE"/>
                    <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM"/>
                </register>
                <register caption="USART Control and Status Register B" name="UCSR0B" offset="0xC1" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE"/>
                    <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ2"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB8"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB8"/>
                </register>
                <register caption="USART Control and Status Register C" name="UCSR0C" offset="0xC2" size="1">
                    <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL" values="COMM_USART_MODE"/>
                    <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL"/>
                </register>
                <register caption="USART Control and Status Register D" name="UCSR0D" offset="0xC3" size="1">
                    <bitfield caption="RX Start Frame Interrupt Enable" mask="0x80" name="RXSIE"/>
                    <bitfield caption="Start Frame Detect Flag" mask="0x40" name="RXS"/>
                    <bitfield caption="Start Frame Detection Enable" mask="0x20" name="SFDE"/>
                </register>
