bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA324PB.xml
                <register caption="USART Baud Rate Register Bytes" name="UBRR0" offset="0xC4" size="2" mask="0x0FFF"/>
            </register-group>
            <register-group caption="USART" name="USART1">
                <register caption="USART I/O Data Register" name="UDR1" offset="0xCE" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART Control and Status Register A" name="UCSR1A" offset="0xC8" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC"/>
                    <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE"/>
                    <bitfield caption="Data overRun" mask="0x08" name="DOR"/>
                    <bitfield caption="Parity Error" mask="0x04" name="UPE"/>
                    <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM"/>
                </register>
                <register caption="USART Control and Status Register B" name="UCSR1B" offset="0xC9" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE"/>
                    <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ2"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB8"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB8"/>
                </register>
                <register caption="USART Control and Status Register C" name="UCSR1C" offset="0xCA" size="1">
                    <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL" values="COMM_USART_MODE"/>
                    <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL"/>
                </register>
                <register caption="USART Control and Status Register D" name="UCSR1D" offset="0xCB" size="1">
                    <bitfield caption="RX Start Frame Interrupt Enable" mask="0x80" name="RXSIE"/>
                    <bitfield caption="Start Frame Detect Flag" mask="0x40" name="RXS"/>
                    <bitfield caption="Start Frame Detection Enable" mask="0x20" name="SFDE"/>
                </register>
                <register caption="USART Baud Rate Register Bytes" name="UBRR1" offset="0xCC" size="2" mask="0x0FFF"/>
            </register-group>
            <register-group caption="USART" name="USART2">
                <register caption="USART I/O Data Register" name="UDR2" offset="0xD6" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="USART Control and Status Register A" name="UCSR2A" offset="0xD0" size="1" ocd-rw="R">
                    <bitfield caption="USART Receive Complete" mask="0x80" name="RXC"/>
                    <bitfield caption="USART Transmitt Complete" mask="0x40" name="TXC"/>
                    <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE"/>
                    <bitfield caption="Framing Error" mask="0x10" name="FE"/>
                    <bitfield caption="Data overRun" mask="0x08" name="DOR"/>
                    <bitfield caption="Parity Error" mask="0x04" name="UPE"/>
                    <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X"/>
                    <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM"/>
                </register>
                <register caption="USART Control and Status Register B" name="UCSR2B" offset="0xD1" size="1">
                    <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE"/>
                    <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE"/>
                    <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE"/>
                    <bitfield caption="Receiver Enable" mask="0x10" name="RXEN"/>
                    <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN"/>
                    <bitfield caption="Character Size" mask="0x04" name="UCSZ2"/>
                    <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB8"/>
                    <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB8"/>
                </register>
                <register caption="USART Control and Status Register C" name="UCSR2C" offset="0xD2" size="1">
                    <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL" values="COMM_USART_MODE"/>
                    <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM" values="COMM_UPM_PARITY_MODE"/>
                    <bitfield caption="Stop Bit Select" mask="0x08" name="USBS" values="COMM_STOP_BIT_SEL"/>
                    <bitfield caption="Character Size" mask="0x06" name="UCSZ"/>
                    <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL"/>
                </register>
                <register caption="USART Control and Status Register D" name="UCSR2D" offset="0xD3" size="1">
                    <bitfield caption="RX Start Frame Interrupt Enable" mask="0x80" name="RXSIE"/>
                    <bitfield caption="Start Frame Detect Flag" mask="0x40" name="RXS"/>
                    <bitfield caption="Start Frame Detection Enable" mask="0x20" name="SFDE"/>
                </register>
