bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA324PB.xml
        <module caption="JTAG Interface" name="JTAG">
            <register-group caption="JTAG Interface" name="JTAG">
                <register caption="On-Chip Debug Related Register in I/O Memory" name="OCDR" offset="0x51" size="1"
                          mask="0xFF" ocd-rw=""/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1" ocd-rw="R">
                    <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
                </register>
            </register-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0x30" name="ISC2"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0x0C" name="ISC1"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0x03" name="ISC0"
                              values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
                    <bitfield caption="External Interrupt Request Enable" mask="0x07" name="INT"/>
                </register>
                <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
                    <bitfield caption="External Interrupt Flags" mask="0x07" name="INTF"/>
                </register>
                <register caption="Pin Change Mask Register 4" name="PCMSK4" offset="0x75" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0x7F" name="PCINT" lsb="32"/>
                </register>
                <register caption="Pin Change Mask Register 3" name="PCMSK3" offset="0x73" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="24"/>
                </register>
                <register caption="Pin Change Mask Register 2" name="PCMSK2" offset="0x6D" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="16"/>
                </register>
                <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x6C" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT" lsb="8"/>
                </register>
                <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT"/>
                </register>
                <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x3B" size="1" ocd-rw="R">
                    <bitfield caption="Pin Change Interrupt Flags" mask="0x1F" name="PCIF"/>
                </register>
                <register caption="Pin Change Interrupt Control Register" name="PCICR" offset="0x68" size="1">
                    <bitfield caption="Pin Change Interrupt Enables" mask="0x1F" name="PCIE"/>
                </register>
            </register-group>
            <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Analog-to-Digital Converter" name="ADC">
            <register-group caption="Analog-to-Digital Converter" name="ADC">
                <register caption="ADC multiplexer Selection Register" name="ADMUX" offset="0x7C" size="1">
                    <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF6"/>
                    <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
                    <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x1F" name="MUX"
                              values="ADC_MUX_DIFF"/>
                </register>
                <register caption="ADC Data Register Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
                <register caption="ADC Control and Status register A" name="ADCSRA" offset="0x7A" size="1" ocd-rw="R">
                    <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
                    <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
                    <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
                    <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
                    <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
                    <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS"
                              values="ANALOG_ADC_PRESCALER"/>
                </register>
                <register caption="ADC Control and Status register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="Enable GPIO function of PE4" mask="0x80" name="GPIOEN"/>
                    <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
                    <bitfield caption="ADC Auto Trigger Source bits" mask="0x07" name="ADTS"
                              values="ANALOG_ADC_AUTO_TRIGGER"/>
                </register>
                <register caption="Digital Input Disable Register" name="DIDR0" offset="0x7E" size="1">
                    <bitfield caption="" mask="0x80" name="ADC7D"/>
                    <bitfield caption="" mask="0x40" name="ADC6D"/>
                    <bitfield caption="" mask="0x20" name="ADC5D"/>
                    <bitfield caption="" mask="0x10" name="ADC4D"/>
                    <bitfield caption="" mask="0x08" name="ADC3D"/>
                    <bitfield caption="" mask="0x04" name="ADC2D"/>
                    <bitfield caption="" mask="0x02" name="ADC1D"/>
                    <bitfield caption="" mask="0x01" name="ADC0D"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_ADC_V_REF6">
                <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
                <value caption="AVCC with external capacitor at AREF pin" name="VAL_0x01" value="0x01"/>
                <value caption="Internal 1.1V Voltage Reference with external capacitor at AREF pin" name="VAL_0x02"
                       value="0x02"/>
                <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="VAL_0x03"
                       value="0x03"/>
            </value-group>
