bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA324PB.xml
                <register caption="Timer/Counter3 Control Register A" name="TCCR3A" offset="0x90" size="1">
                    <bitfield caption="Compare Output Mode 3A, bits" mask="0xC0" name="COM3A"/>
                    <bitfield caption="Compare Output Mode 3B, bits" mask="0x30" name="COM3B"/>
                    <bitfield caption="Pulse Width Modulator Select Bits" mask="0x03" name="WGM3"/>
                </register>
                <register caption="Timer/Counter3 Control Register B" name="TCCR3B" offset="0x91" size="1">
                    <bitfield caption="Input Capture 3 Noise Canceler" mask="0x80" name="ICNC3"/>
                    <bitfield caption="Input Capture 3 Edge Select" mask="0x40" name="ICES3"/>
                    <bitfield caption="Waveform Generation Mode Bits" mask="0x18" name="WGM3" lsb="2"/>
                    <bitfield caption="Clock Select3 bits" mask="0x07" name="CS3" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter3 Control Register C" name="TCCR3C" offset="0x92" size="1" ocd-rw="">
                    <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC3A"/>
                    <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC3B"/>
                </register>
                <register caption="Timer/Counter3 Bytes" name="TCNT3" offset="0x94" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Output Compare Register A Bytes" name="OCR3A" offset="0x98" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter3 Output Compare Register B Bytes" name="OCR3B" offset="0x9A" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter3 Input Capture Register Bytes" name="ICR3" offset="0x96" size="2"
                          mask="0xFFFF"/>
            </register-group>
            <register-group caption="Timer/Counter, 16-bit" name="TC4">
                <register caption="Timer/Counter4 Interrupt Mask Register" name="TIMSK4" offset="0x72" size="1">
                    <bitfield caption="Timer/Counter4 Input Capture Interrupt Enable" mask="0x20" name="ICIE4"/>
                    <bitfield caption="Timer/Counter4 Output Compare B Match Interrupt Enable" mask="0x04"
                              name="OCIE4B"/>
                    <bitfield caption="Timer/Counter4 Output Compare A Match Interrupt Enable" mask="0x02"
                              name="OCIE4A"/>
                    <bitfield caption="Timer/Counter4 Overflow Interrupt Enable" mask="0x01" name="TOIE4"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag register" name="TIFR4" offset="0x39" size="1"
                          ocd-rw="R">
                    <bitfield caption="Timer/Counter4 Input Capture Flag" mask="0x20" name="ICF4"/>
                    <bitfield caption="Timer/Counter4 Output Compare B Match Flag" mask="0x04" name="OCF4B"/>
                    <bitfield caption="Timer/Counter4 Output Compare A Match Flag" mask="0x02" name="OCF4A"/>
                    <bitfield caption="Timer/Counter4 Overflow Flag" mask="0x01" name="TOV4"/>
                </register>
                <register caption="Timer/Counter4 Control Register A" name="TCCR4A" offset="0xA0" size="1">
                    <bitfield caption="Compare Output Mode 4A, bits" mask="0xC0" name="COM4A"/>
                    <bitfield caption="Compare Output Mode 4B, bits" mask="0x30" name="COM4B"/>
                    <bitfield caption="Pulse Width Modulator Select Bits" mask="0x03" name="WGM4"/>
                </register>
                <register caption="Timer/Counter4 Control Register B" name="TCCR4B" offset="0xA1" size="1">
                    <bitfield caption="Input Capture 4 Noise Canceler" mask="0x80" name="ICNC4"/>
                    <bitfield caption="Input Capture 4 Edge Select" mask="0x40" name="ICES4"/>
                    <bitfield caption="Waveform Generation Mode Bits" mask="0x18" name="WGM4" lsb="2"/>
                    <bitfield caption="Clock Select4 bits" mask="0x07" name="CS4" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter4 Control Register C" name="TCCR4C" offset="0xA2" size="1" ocd-rw="">
                    <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC4A"/>
                    <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC4B"/>
                </register>
                <register caption="Timer/Counter4 Bytes" name="TCNT4" offset="0xA4" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter4 Output Compare Register A Bytes" name="OCR4A" offset="0xA8" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter4 Output Compare Register B Bytes" name="OCR4B" offset="0xAA" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter4 Input Capture Register Bytes" name="ICR4" offset="0xA6" size="2"
                          mask="0xFFFF"/>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
