bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA324PB.xml
                <register caption="TWI Data register" name="TWDR0" offset="0xBB" size="1" mask="0xFF"/>
                <register caption="TWI (Slave) Address register" name="TWAR0" offset="0xBA" size="1">
                    <bitfield caption="TWI (Slave) Address register Bits" mask="0xFE" name="TWA"/>
                    <bitfield caption="TWI General Call Recognition Enable Bit" mask="0x01" name="TWGCE"/>
                </register>
            </register-group>
            <register-group caption="Two Wire Serial Interface" name="TWI1">
                <register caption="TWI (Slave) Address Mask Register" name="TWAMR1" offset="0xDD" size="1">
                    <bitfield caption="" mask="0xFE" name="TWAM1"/>
                </register>
                <register caption="TWI Bit Rate register" name="TWBR1" offset="0xD8" size="1" mask="0xFF"/>
                <register caption="TWI Control Register" name="TWCR1" offset="0xDC" size="1" ocd-rw="R">
                    <bitfield caption="TWI Interrupt Flag" mask="0x80" name="TWINT"/>
                    <bitfield caption="TWI Enable Acknowledge Bit" mask="0x40" name="TWEA"/>
                    <bitfield caption="TWI Start Condition Bit" mask="0x20" name="TWSTA"/>
                    <bitfield caption="TWI Stop Condition Bit" mask="0x10" name="TWSTO"/>
                    <bitfield caption="TWI Write Collition Flag" mask="0x08" name="TWWC"/>
                    <bitfield caption="TWI Enable Bit" mask="0x04" name="TWEN"/>
                    <bitfield caption="TWI Interrupt Enable" mask="0x01" name="TWIE"/>
                </register>
                <register caption="TWI Status Register" name="TWSR1" offset="0xD9" size="1">
                    <bitfield caption="TWI Status" mask="0xF8" name="TWS0" lsb="3"/>
                    <bitfield caption="TWI Prescaler" mask="0x03" name="TWPS" values="COMM_TWI_PRESCALE"/>
                </register>
                <register caption="TWI Data register" name="TWDR1" offset="0xDB" size="1" mask="0xFF"/>
                <register caption="TWI (Slave) Address register" name="TWAR1" offset="0xDA" size="1">
                    <bitfield caption="TWI (Slave) Address register Bits" mask="0xFE" name="TWA"/>
                    <bitfield caption="TWI General Call Recognition Enable Bit" mask="0x01" name="TWGCE"/>
                </register>
            </register-group>
            <value-group caption="" name="COMM_TWI_PRESCALE">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="4" name="VAL_0x01" value="0x01"/>
                <value caption="16" name="VAL_0x02" value="0x02"/>
                <value caption="64" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Clock Failure Detection" name="CFD">
            <register-group caption="Clock Failure Detection" name="CFD">
                <register caption="XOSC Failure Detection Control and Status Register" name="XFDCSR" offset="0x62"
                          size="1">
                    <bitfield caption="Failure Detection Interrupt Flag" mask="0x02" name="XFDIF"/>
                    <bitfield caption="Failure Detection Interrupt Enable" mask="0x01" name="XFDIE"/>
                </register>
            </register-group>
        </module>
        <module caption="Peripheral Touch Controller" name="PTC"/>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Status Register" name="SREG" offset="0x5F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
                <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0x1FFF"/>
                <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
                    <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
                    <bitfield caption="BOD Power Down in Sleep" mask="0x40" name="BODS"/>
                    <bitfield caption="BOD Power Down in Sleep Enable" mask="0x20" name="BODSE"/>
                    <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
                    <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
                    <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
                </register>
                <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
                    <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
                    <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
                    <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
                    <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
                    <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
                </register>
                <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x66" size="1" mask="0xFF">
                    <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
                </register>
                <register caption="" name="CLKPR" offset="0x61" size="1" ocd-rw="R">
                    <bitfield caption="" mask="0x80" name="CLKPCE"/>
                    <bitfield caption="" mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
                </register>
                <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
                    <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
                    <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
                </register>
