bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA324PB.xml
                <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x4B" size="1" mask="0xFF"/>
                <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1" mask="0xFF"/>
                <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1" mask="0xFF"/>
                <register caption="Power Reduction Register0" name="PRR0" offset="0x64" size="1">
                    <bitfield caption="Power Reduction TWI0" mask="0x80" name="PRTWI0"/>
                    <bitfield caption="Power Reduction Timer/Counter2" mask="0x40" name="PRTIM2"/>
                    <bitfield caption="Power Reduction Timer/Counter0" mask="0x20" name="PRTIM0"/>
                    <bitfield caption="Power Reduction USART1" mask="0x10" name="PRUSART1"/>
                    <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
                    <bitfield caption="Power Reduction Serial Peripheral Interface 0" mask="0x04" name="PRSPI0"/>
                    <bitfield caption="Power Reduction USART0" mask="0x02" name="PRUSART0"/>
                    <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
                </register>
                <register caption="Power Reduction Register1" name="PRR1" offset="0x65" size="1">
                    <bitfield caption="Power Reduction Timer/Counter4" mask="0x02" name="PRTIM4"/>
                    <bitfield caption="Power Reduction Timer/Counter3" mask="0x01" name="PRTIM3"/>
                </register>
                <register caption="Power Reduction Register2" name="PRR2" offset="0x63" size="1">
                    <bitfield caption="Power Reduction Peripheral Touch Controller" mask="0x08" name="PRPTC"/>
                    <bitfield caption="Power Reduction USART2" mask="0x04" name="PRUSART2"/>
                    <bitfield caption="Power Reduction Serial Peripheral Interface 1" mask="0x02" name="PRSPI1"/>
                    <bitfield caption="Power Reduction TWI1" mask="0x01" name="PRTWI1"/>
                </register>
                <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
                    <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
                    <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
                    <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
                    <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
                    <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
            </register-group>
            <value-group caption="" name="CPU_CLK_PRESCALE_4_BITS_SMALL">
                <value caption="1" name="VAL_0x00" value="0x00"/>
                <value caption="2" name="VAL_0x01" value="0x01"/>
                <value caption="4" name="VAL_0x02" value="0x02"/>
                <value caption="8" name="VAL_0x03" value="0x03"/>
                <value caption="16" name="VAL_0x04" value="0x04"/>
                <value caption="32" name="VAL_0x05" value="0x05"/>
                <value caption="64" name="VAL_0x06" value="0x06"/>
                <value caption="128" name="VAL_0x07" value="0x07"/>
                <value caption="256" name="VAL_0x08" value="0x08"/>
            </value-group>
            <value-group caption="" name="CPU_SLEEP_MODE_3BITS">
                <value caption="Idle" name="IDLE" value="0x00"/>
                <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
                <value caption="Power Down" name="PDOWN" value="0x02"/>
                <value caption="Power Save" name="PSAVE" value="0x03"/>
                <value caption="Reserved" name="VAL_0x04" value="0x04"/>
                <value caption="Reserved" name="VAL_0x05" value="0x05"/>
                <value caption="Standby" name="STDBY" value="0x06"/>
                <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
            </value-group>
            <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
                <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
            </value-group>
        </module>
    </modules>
    <pinouts>
        <pinout name="TQFP44" caption="TQFP44">
            <pin position="1" pad="PB5"/>
            <pin position="2" pad="PB6"/>
            <pin position="3" pad="PB7"/>
            <pin position="4" pad="RESET"/>
            <pin position="5" pad="VCC"/>
            <pin position="6" pad="GND"/>
            <pin position="7" pad="PE0"/>
            <pin position="8" pad="PE1"/>
            <pin position="9" pad="PD0"/>
            <pin position="10" pad="PD1"/>
            <pin position="11" pad="PD2"/>
            <pin position="12" pad="PD3"/>
            <pin position="13" pad="PD4"/>
            <pin position="14" pad="PD5"/>
            <pin position="15" pad="PD6"/>
            <pin position="16" pad="PD7"/>
            <pin position="17" pad="PE2"/>
            <pin position="18" pad="PE3"/>
            <pin position="19" pad="PC0"/>
            <pin position="20" pad="PC1"/>
            <pin position="21" pad="PC2"/>
            <pin position="22" pad="PC3"/>
            <pin position="23" pad="PC4"/>
            <pin position="24" pad="PC5"/>
            <pin position="25" pad="PC6"/>
            <pin position="26" pad="PC7"/>
            <pin position="27" pad="AVCC"/>
            <pin position="28" pad="GND"/>
            <pin position="29" pad="PE4"/>
            <pin position="30" pad="PA7"/>
            <pin position="31" pad="PA6"/>
            <pin position="32" pad="PA5"/>
            <pin position="33" pad="PA4"/>
            <pin position="34" pad="PA3"/>
            <pin position="35" pad="PA2"/>
            <pin position="36" pad="PA1"/>
            <pin position="37" pad="PA0"/>
            <pin position="38" pad="PE5"/>
            <pin position="39" pad="PE6"/>
            <pin position="40" pad="PB0"/>
            <pin position="41" pad="PB1"/>
            <pin position="42" pad="PB2"/>
            <pin position="43" pad="PB3"/>
            <pin position="44" pad="PB4"/>
        </pinout>
        <pinout name="VQFN44" caption="VQFN44">
            <pin position="1" pad="PB5"/>
            <pin position="2" pad="PB6"/>
            <pin position="3" pad="PB7"/>
            <pin position="4" pad="RESET"/>
            <pin position="5" pad="VCC"/>
            <pin position="6" pad="GND"/>
            <pin position="7" pad="PE0"/>
            <pin position="8" pad="PE1"/>
            <pin position="9" pad="PD0"/>
            <pin position="10" pad="PD1"/>
            <pin position="11" pad="PD2"/>
            <pin position="12" pad="PD3"/>
            <pin position="13" pad="PD4"/>
            <pin position="14" pad="PD5"/>
            <pin position="15" pad="PD6"/>
            <pin position="16" pad="PD7"/>
            <pin position="17" pad="PE2"/>
            <pin position="18" pad="PE3"/>
            <pin position="19" pad="PC0"/>
            <pin position="20" pad="PC1"/>
            <pin position="21" pad="PC2"/>
            <pin position="22" pad="PC3"/>
            <pin position="23" pad="PC4"/>
            <pin position="24" pad="PC5"/>
            <pin position="25" pad="PC6"/>
            <pin position="26" pad="PC7"/>
            <pin position="27" pad="AVCC"/>
            <pin position="28" pad="GND"/>
            <pin position="29" pad="PE4"/>
            <pin position="30" pad="PA7"/>
            <pin position="31" pad="PA6"/>
            <pin position="32" pad="PA5"/>
            <pin position="33" pad="PA4"/>
            <pin position="34" pad="PA3"/>
            <pin position="35" pad="PA2"/>
            <pin position="36" pad="PA1"/>
            <pin position="37" pad="PA0"/>
            <pin position="38" pad="PE5"/>
            <pin position="39" pad="PE6"/>
            <pin position="40" pad="PB0"/>
            <pin position="41" pad="PB1"/>
            <pin position="42" pad="PB2"/>
            <pin position="43" pad="PB3"/>
            <pin position="44" pad="PB4"/>
        </pinout>
    </pinouts>
</target-description-file>
